Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courtroom/barristers.html.txt.tmx
Source language: en
Languages: ga

source: A barrister (also called "counsel") is a type of lawyer who specialises in court advocacy and the giving of legal opinion
ga: Cineál dlíodóra is ea abhcóide ar speisialtóir é in abhcóideacht chúirte agus i gcomhairle dlíthiúil

source: To become a barrister, you must pass the exams set by the Kings Inns
ga: Ní mór do abhcóidí bónaí bána agus róba dubh a chaitheamh i bhformhór na gcúirteanna

source: (The Kings Inns is the body which governs entry to the profession of barrister-at-law in Ireland)
ga: Ní mór dóibh peiriúic a chaitheamh chomh maith

source: After you have passed your exams, you must be "called to the Bar" and you must complete a year of "devilling", which is a form of apprenticeship for barristers
ga: I gcúirteanna áirithe, mar shampla a i gcúirteanna dlí teaghlaigh, ní chaitheann abhcóidí peiriúic nó róbaí

source: Barristers must wear white collars and a black gown in most courts. They may also wear a wig
ga: In Éirinn ní ligtear do abhcóidí seomraí nó comhpháirtíochtaí a bhunú

source: In certain courts, such as the family law courts and the children's court, barristers do not wear the wig and gown
ga: Tá gach abhcóide féin-fhostaithe agus oibríonn sé mar dhuine aonair

source: Barristers are not allowed to set up "chambers" or partnerships together
ga: Ní cheadaítear d’abhcóidí “dlísheomraí” nó comhpháirtíochtaí a bhunú le chéile

source: Each barrister is self-employed and works as an individual
ga: Tá gach abhcóide féinfhostaithe agus oibríonn sé/sí mar dhuine aonair

source: In December 2015, the Oireachtas passed the Legal Services Regulation Act 2015 which provides for, among other things, new business models for legal practitioners including barrister/barrister and barrister/solicitor partnerships and multi-disciplinary practices
ga: I Nollaig 2015, rith an tOireachtas an tAcht um Rialáil Seirbhísí Dlí, 2015 a fhorálann, i measc rudaí eile, do shamhlacha nua gnó do chleachtóirí dlí, ina measc comhpháirtíochtaí abhcóide/abhcóide agus abhcóide/aturnae agus cleachtais ildisciplíneacha

source: If you are involved in a court case, you may come across junior and senior counsel
ga: Má tá tú páirteach i gcás dlí d'fhéadfá bualach le abhcóidí sóisir agus sinsir

source: Barristers have a wide range of different functions:
ga: Tá réimse leathan feidhmeanna an ag abhcóidí:

source: • Barristers draft legal opinions
ga: • Dréachtaíonn abhcóidí comhairle dhlíthiúil

source: For example, a barrister might give you a legal opinion on whether or not you have a good legal case against someone with whom you have had a dispute
ga: Mar shampla, d'fhéadfadh abhcóide comhairle dhlíthiúil a thabhairt duit faoi cibé and bhfuil nó nach bhfuil cás maith agat i gcoinne duine a bhfuil díospóid agat leis

source: • The barrister will then write the legal documents (writs or pleadings) which must be filed in the case
ga: • Déanfaidh an abhcóide ansin na doiciméid dhlithiúla a scríobh (eascairí nó pleadálacha) a chaithfear a chomhdú sa chás

source: • When the case comes to trial, it is the barrister who will represent you in court, speak on your behalf and argue your case before the judge
ga: • Nuair a thagann an cás chun trialach is é an abhcóide a fheidhmeoidh agus a labhróidh ar do shon, agus a chuirfidh do cás faoi bhráid an bhreithimh

source: • Your barrister may also be the person who negotiates a settlement of your case instead of it going to trial
ga: • D'fhéadfadh do abhcóide socraíocht do cháis a idirbheartú in ionad ligean dó a dhul chun trialach

source: Barristers are not contacted directly by the public - they are engaged by solicitors to work on a case
ga: Ní féidir teagmháil a dhéanamh go díreach le abhcóide - déanann aturnaetha iad a fhostú chun obair ar chás

source: When you contact a solicitor for legal advice, your solicitor may recommend that a barrister be engaged to provide services
ga: Nuair a theann tú i dteagmháil le aturnae ag lorg comhairle dlithiúla, d'fhéadfadh do aturnae moladh duit go ndéanfaí abhcóide a fhostú chun seirbhísí a sholáthar

source: If you and your solicitor decide to involve a barrister in your case, the solicitor will send the barrister a brief containing all the relevant information and documents to assist the barrister in the presentation of the case
ga: Má shocraíonn tú agus do aturnae ar abhcóide a úsáid i do chás, cuirfidh an aturnae mionteagasc chuig an abhcóide leis an eolas ábhartha agus na doiciméid uilig chun cabhrú leis nó léi an cás a chur i láthair

source: Barristers must act in accordance with the Bar Council Professional Code of Conduct
ga: Caithfidh abhcóidí feidhmiú de réir Cód Proifisiúnta Iompair Chomhairle an Bharra

source: Barristers are subject to many general rules, such as:
ga: Caitheann abhcóidí cuid mhaith rialacha ginearálta a leanúint, mar shampla:

source: • A barrister may only accept so much work as they can give adequate attention to within a reasonable time
ga: • Ní féidir le abhcóide obair a ghlacadh thar an méid ar féidir leis a dhóthain airde a thabhairt air laistigh de achar réasúnta

source: • A barrister must ensure confidentiality concerning client matters
ga: • Ní mór do abhcóide rúndacht a chinntiú maidir le hábhair cliant

source: • A barrister has duties towards the courts and they cannot mislead a court in any way
ga: • Tá dualgais ag abhcóide ó thaobh na cúirte de agus ní féidir leis nó léi an chúirt a chur amú ar aon bhealach

source: • A barrister may not tout or advertise their services
ga: • Ní féidir le abhcóide stocaireacht a dhéanamh ar chustaiméirí nó a chuid/a cuid seirbhísí a fhógairt

source: There are also more specific rules about the duties of barristers in criminal cases
ga: Tá rialacha níos sainiúla ann faoi dhualgais abhcóidí i gcásanna coiriúla

source: Barristers' rates and fees vary greatly
ga: Tá difríochtaí móra sna rátaí agus táillí a iarrann abhcóidí

source: You should ask your solicitor how much it will cost to engage a barrister to act on your behalf
ga: Ba chóir ceist a chur ar do aturnae faoin gcostas a bheidh ar abhcóide a fhostú chun feidhmiú ar do shon

source: To engage a barrister, you must contact a solicitor who will then "brief" the barrister
ga: Chun abhcóide a fhostú, ní mór duit teagmháil a dhéanamh le aturnae, agus cuirfidh sé sin mionteagasc chuig an abhcóide
